import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-navbar',
  templateUrl:'./navbar.component.html',
  styleUrls: ['./navbar.component.scss']
})
export class NavbarComponent implements OnInit {
  navbarItems:any=[
    {
      name: "جدیدترین‌ها",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
        title:'جدیدترین‌ها',
        listItem:[
          'مردانه',
          'زنانه',
          'نوجوان',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
        ]
      },
    ]
    },
    {
      name: "زنانه",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
        title:'لباس زنانه',
        listItem:[
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
          'پافر',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
          'پافر',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
          'پافر',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
          'پافر',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کاپشن،بارانی و پالتو',
          'پافر',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
        ]
      },
      {
        title:'زیورآلات',
        listItem:[
          'پافر',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
          'پافر',
          'بچگانه',
          'کاکا اسپرت',
          'عطر و ادکلن',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کارت هدیه',
          'ست هدیه'
        ]
      }
    ]
    },
    {
      name: "مردانه",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
          title:'لباس مردانه',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'کیف و کفش',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'اکسسوری',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'سبک خودتو بساز',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'انتخاب را هدیه دهید',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
      ]
    },
    {
      name: "نوجوان",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
          title:'لباس مردانه',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'کیف و کفش',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'اکسسوری',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'سبک خودتو بساز',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'انتخاب را هدیه دهید',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
      ]
    },
    {name: "بچگانه",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
    {name: "سایز بزرگ",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
    {name: "کاکااسپرت",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
    {name: "آرایشی و بهداشتی",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
    {
      name: "عطر و ادکلن",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
          title:'لباس مردانه',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'کیف و کفش',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'اکسسوری',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'سبک خودتو بساز',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'انتخاب را هدیه دهید',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
      ]
    },
    {name: "لوازم خانه",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
    {
      name: "کی تویز",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
          title:'لباس مردانه',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'کیف و کفش',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'اکسسوری',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'سبک خودتو بساز',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'انتخاب را هدیه دهید',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
      ]
    },
    {
      name: "فرهنگ و هنر",
      class:{'opacity-0':true,'hidden':true},
      items:[
        {
          title:'لباس مردانه',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'کیف و کفش',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'اکسسوری',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'سبک خودتو بساز',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
        {
          title:'انتخاب را هدیه دهید',
          listItem:[
            'کفش',
            'بوت و نیم بوت',
            'کاکا اسپرت',
            'عطر و ادکلن',
            'آرایشی بهداشتی',
            'اکسسوری',
            'لوازم خانه',
            'کی تویز',
            'فرهنگ و هنر',
            'سویشرت و هودی',
            'کاپشن،بارانی و پالتو',
          ]
        },
      ]
    },
    {name: "برندها",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
    {name: "فروش ویژه",
    class:{'opacity-0':true,'hidden':true},
    items:[
      {
        title:'لباس مردانه',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'کیف و کفش',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'اکسسوری',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'سبک خودتو بساز',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
      {
        title:'انتخاب را هدیه دهید',
        listItem:[
          'کفش',
          'بوت و نیم بوت',
          'کاکا اسپرت',
          'عطر و ادکلن',
          'آرایشی بهداشتی',
          'اکسسوری',
          'لوازم خانه',
          'کی تویز',
          'فرهنگ و هنر',
          'سویشرت و هودی',
          'کاپشن،بارانی و پالتو',
        ]
      },
    ]
  },
  ]
  constructor() { }

  ngOnInit(): void {
  }
  openNavbarItem(index:number){
    this.navbarItems[index].class = {'opacity-0':true , 'hidden':false};
    setTimeout(() => {
      this.navbarItems[index].class = {'opacity-1':false , 'hidden':false}
    }, 1);
  }
  closeNavbarItem(index:number){
    this.navbarItems[index].class = {'opacity-0':true , 'hidden':false};
    setTimeout(() => {
      this.navbarItems[index].class = {'opacity-1':true , 'hidden':true}
    }, 300);
  }
}
